{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "StripedHyena",
    "parent_library": "stripedhyena.model"
  },
  "base_model_name_or_path": null,
  "bias": "none",
  "corda_config": null,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_bias": false,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "l2",
    "out_proj",
    "l1",
    "Wqkv",
    "l3"
  ],
  "task_type": null,
  "trainable_token_indices": null,
  "use_dora": false,
  "use_rslora": false
}